БухЭксп/Catalogs/CW_ГрузоотправителиИГрузополучатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ГрузоотправителиИГрузополучатели</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Пункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Comment>Страна резиденства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоДляСвязи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСвязиСКонтактнымЛицом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ГрузоотправителиИГрузополучатели/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьИННАдреса();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.Отправитель и Не Объект.Получатель Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо установить хотябы один флаг!",,"Отправитель","Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры    
 
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьИННАдреса();
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  
	
	КонтрагентПриИзмененииНаСервере(); 

КонецПроцедуры   

&НаСервере
Процедура УстановитьДоступностьИННАдреса()  
	
	Элементы.ГруппаИННАдерсОбъекта.Видимость 		= Не ЗначениеЗаполнено(Объект.Контрагент);
 	Элементы.ГруппаИННАдерсКонтрагента.Видимость 	= ЗначениеЗаполнено(Объект.Контрагент);
  
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	КонтрагентПриИзмененииНаСервере(); 

	УстановитьРеквизитыОбъекта();
	
	УстановитьДоступностьИННАдреса();

КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитыОбъекта()
	
	Если Объект.Контрагент.Пустая() Тогда
		Объект.Страна = Страна;
		Объект.Город = Город;
		Объект.ИНН = ИНН;
		Объект.ЮридическийАдрес = ЮридическийАдрес;
		Объект.ЮридическоеФизическоеЛицо = ЮридическоеФизическоеЛицо;
	КонецЕсли;
	
КонецПроцедуры  



&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()   
	
	Если Объект.Контрагент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
   	СведенияОКонтрагенте = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(Объект.Контрагент,  ТекущаяДата());   
	
	ИНН 						= СведенияОКонтрагенте.ИНН; 
    ЮридическоеФизическоеЛицо 	= СведенияОКонтрагенте.ЮридическоеФизическоеЛицо;  
	Страна 						= Объект.Контрагент.СтранаРегистрации; 
	
	Если Не ПустаяСтрока(СведенияОКонтрагенте.ЗначениеJSONЮридическийАдрес) Тогда
		СтруктураАдреса = CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СведенияОКонтрагенте.ЗначениеJSONЮридическийАдрес);
		
		ЮридическийАдрес 	= СтруктураАдреса.value;
		
		Если  СтруктураАдреса.Свойство("city") Тогда
			Город = СтруктураАдреса.city;
		ИначеЕсли СтруктураАдреса.Свойство("area") Тогда
			Город = СтруктураАдреса.area;
		КонецЕсли;    
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПеревод(Команда)    

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ЮридическийАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ГородПеревод(Команда)     

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "Город");
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПеревод(Команда)   
	
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ПолноеНаименование");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоДляСвязиПеревод(Команда)
	
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "КонтактноеЛицоДляСвязи");
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСвязиСКонтактнымЛицомПеревод(Команда)
	
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "СпособСвязиСКонтактнымЛицом");
	
КонецПроцедуры
